unload/cf/InformationRegisters/ВСД_ПроизводственнаяСпецификация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ВСД_ПроизводственнаяСпецификация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

unload/cf/CommonModules/ВСД_Производство/Ext/Module.bsl
#Область СписаниеВПроизводство

//Функция ПолучитьТЗСырьяДляСписанияВПроизводствоПоПродукцияЭлемент(ВыбраннаяПродукция,КоличествоПродукции = 0) Экспорт
Функция ПолучитьТзСырьеПоВСД_Продукция_Элемент(ВыбраннаяПродукция, КоличествоПродукции = 0) Экспорт
	//Возвращает Продукция_Элементы и Количество сырья , требуемое для выпуска КоличествоПродукции ВыбраннойПродукции
	ТЗСырье = Новый ("ТаблицаЗначений");
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	ВСД_ПроизводственнаяСпецификация.Сырье КАК Продукция_Элемент,
                   |	ВСД_ПроизводственнаяСпецификация.Коэффициент
                   |ИЗ
                   |	РегистрСведений.ВСД_ПроизводственнаяСпецификация КАК ВСД_ПроизводственнаяСпецификация
                   |ГДЕ
                   |	ВСД_ПроизводственнаяСпецификация.Продукция = &ВыбПродукция";
    Запрос.УстановитьПараметр("ВыбПродукция", ВыбраннаяПродукция);

    ТЗСырье = Запрос.Выполнить().Выгрузить();
	ТЗСырье.Колонки.Добавить("Количество",новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));  //Требуемое кол-во сырья на 100 кг ВыбраннаяПродукция
	Если КоличествоПродукции <> 0 Тогда
		Для каждого СтрСырье из ТЗСырье Цикл
			СтрСырье.Количество = КоличествоПродукции * СтрСырье.Коэффициент / 100; // на 100 кг продукции
		КонецЦикла
	КонецЕсли;
	Возврат ТЗСырье;
КонецФункции

//СформироватьТЧСырьяДляСписанияВПроизводствоПоСписку
Функция ЗаполнитьСырьеИзВСД_Продукция_Элемент(тзПродукции) Экспорт
	ТЗВсегоСырье = Новый ("ТаблицаЗначений");
	ТЗВсегоСырье.Колонки.Добавить("Продукция_Элемент",новый ОписаниеТипов("СправочникСсылка.ВСД_Продукция_Элемент"));
	ТЗВсегоСырье.Колонки.Добавить("Количество",новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
	
	Для каждого СтрокаПродукции из тзПродукции Цикл
		тзСырье = ПолучитьТзСырьеПоВСД_Продукция_Элемент( СтрокаПродукции.Продукция_Элемент, СтрокаПродукции.Количество );
		Для каждого СтрокаСырье из ТЗСырье Цикл
			ЗаполнитьЗначенияСвойств(ТЗВсегоСырье.Добавить(), СтрокаСырье) 
		КонецЦикла
	КонецЦикла;
	
	ТЗВсегоСырье.Свернуть("Продукция_Элемент","Количество");
	
	Возврат ТЗВсегоСырье; 
КонецФункции

//Функция ПолучитьТЗПартииКСписаниюПоТЗПродукцияЭлементов(Параметры, тзЭлементыкСписанию, тзАктуальныхПартий = "") Экспорт
Функция тзЗаполнитьПартииСписанияПоТзПродукция(Параметры, тзЭлементыкСписанию, КоличествоСписания, тзАктуальныхПартий, ПартииКСписанию) 
// Аналог Процедуры ЗаполнитьТЧВСД, только вместо заполнения ТЧ документа Возвращает ТЗ	
// рассмотреть вариант Оптимизации
// Параметр тзАктуальныхПартий необходим при групповом рспределении
// в Парам = Структура переданы Отправитель_ХозСубъект и Отправитель_Площадка

	Если НЕ ЗначениеЗаполнено(тзАктуальныхПартий) Тогда
			ВСД.СообщитьИнфо("Не переданы параметры для получения Актуальных партий - ДанныеЗаполнения или тзЭлементыОснования");
			Возврат ПартииКСписанию;
	КонецЕсли;
	
	//Для Каждого ТекСтрокаТовары Из тзЭлементыкСписанию Цикл
	//	Продукция_Элемент = ТекСтрокаТовары.Продукция_Элемент;
		//**** 
		//СтрокиПартий = ВСД.ПодобратьПартииПоПродукцияЭлемент( тзАктуальныхПартий, ТекСтрокаТовары.Продукция_Элемент, ТекСтрокаТовары.Количество );
		СтрокиПартий = ВСД.ПодобратьПартии( тзАктуальныхПартий, КоличествоСписания );
		Если СтрокиПартий.Количество() = 0  Тогда
			Если Параметры["ПарамЗаполнятьТранзакциюПриОтсутствииПартий"] Тогда
				НоваяСтрока = ПартииКСписанию.Добавить();
				//ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрокаТовары);
				НоваяСтрока.Количество = КоличествоСписания;
				//НоваяСтрока.Продукция_Элемент = Продукция_Элемент;
				//НоваяСтрока.ЕдиницаИзмерения = Продукция_Элемент.ЕдиницаИзмерения;
				//Обработка.ЗаполнитьРеквизитыСтрокиВСД(НоваяСтрока, ТекСтрокаТовары, докСсылка);
				//Продолжить;
			КонецЕсли;
			  ВСД.СообщитьИнфо("Нет партий пропускаем..");				
			//ВСД.СообщитьИнфо("Нет партий для ["+ТекСтрокаТовары.Номенклатура +"] Продукция_Элемент ["+ Строка(Продукция_Элемент) +"] Пропускаем!");				
		   	//Продолжить;
		КонецЕсли;
		
		Для каждого СтрПартии из СтрокиПартий Цикл
			НоваяСтрока = ПартииКСписанию.Добавить();
			НоваяСтрока.Партия = СтрПартии.Партия;
			НоваяСтрока.Количество = СтрПартии.Количество;
			НоваяСтрока.ЕдиницаИзмерения = СтрПартии.Партия.ЕдиницаИзмерения;
			НоваяСтрока.Продукция_Элемент = НоваяСтрока.Партия.Продукция_Элемент;			
			НоваяСтрока.Продукция = НоваяСтрока.Партия.Продукция;			
			НоваяСтрока.ВидПродукции = НоваяСтрока.Партия.ВидПродукции;			
		КонецЦикла;
		
		Если (СтрокиПартий.Итог("Количество") < КоличествоСписания) и Параметры["ПарамЗаполнятьТранзакциюПриОтсутствииПартий"]  Тогда
			//Добавим с пустыми партиями
			НоваяСтрока = ПартииКСписанию.Добавить();
			//НоваяСтрока.Продукция_Элемент = Продукция_Элемент;
			НоваяСтрока.Количество	=  КоличествоСписания - СтрокиПартий.Итог("Количество") ;
			//НоваяСтрока.ЕдиницаИзмерения = Продукция_Элемент.ЕдиницаИзмерения;
//			Обработка.ЗаполнитьРеквизитыСтрокиВСД(НоваяСтрока, ТекСтрокаТовары, докСсылка);
				
		КонецЕсли; 
	//КонецЦикла;
	
	Возврат ПартииКСписанию;
КонецФункции


//Возвращает Продукция_Элементы и Количество сырья , требуемое для выпуска КоличествоПродукции ВыбраннойПродукции
Функция ПолучитьСырьеИзСпецификацииНоменклатуры( ВыбНоменклатура, КоличествоПродукции = 0) 
	тзСырье = Новый("ТаблицаЗначений");
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	СпецификацииНоменклатуры.Ссылка.Владелец КАК НоменклатураПродукция,
                   |	СпецификацииНоменклатуры.Ссылка.Количество КАК КоличествоПродукции,
                   |	СпецификацииНоменклатуры.Номенклатура КАК НоменклатураСырье,
                   |	СпецификацииНоменклатуры.Количество КАК КоличествоСырья,
                   |	ВСД_Соответсвия.ПродукцияЭлемент КАК Продукция_Элемент
                   |ИЗ
                   |	Справочник.СпецификацииНоменклатуры.ИсходныеКомплектующие КАК СпецификацииНоменклатуры
                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
                   |		ПО СпецификацииНоменклатуры.Номенклатура = ВСД_Соответсвия.Владелец
                   |ГДЕ
                   |	СпецификацииНоменклатуры.Ссылка.Владелец = &ВыбНоменклатура";
	
    Запрос.УстановитьПараметр("ВыбНоменклатура", ВыбНоменклатура);

    ТЗСырье = Запрос.Выполнить().Выгрузить();
	ТЗСырье.Колонки.Добавить("Количество",новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));  //Требуемое кол-во сырья на 1 кг ВыбНоменклатура
	
	Если КоличествоПродукции > 0 Тогда
		Для каждого СтрСырье из ТЗСырье Цикл
			СтрСырье.Количество = КоличествоПродукции * СтрСырье.КоличествоСырья / СтрСырье.КоличествоПродукции;
		КонецЦикла
	КонецЕсли;
	
	Возврат ТЗСырье;
	
КонецФункции

Функция ЗаполнитьТчСписаниеИзСпецификацииНоменклатуры( Знач Параметры, тзНоменклатуры ) Экспорт
	Попытка 
		ПартииКСписанию = новый ("ТаблицаЗначений"); //Можно структуру скопировать из вызывающего документа, если в параметр его добавить
		ПартииКСписанию.Колонки.Добавить("Номенклатура",новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ПартииКСписанию.Колонки.Добавить("Продукция_Элемент",новый ОписаниеТипов("СправочникСсылка.ВСД_Продукция_Элемент"));
		ПартииКСписанию.Колонки.Добавить("Продукция",новый ОписаниеТипов("СправочникСсылка.ВСД_Продукция"));
		ПартииКСписанию.Колонки.Добавить("ВидПродукции",новый ОписаниеТипов("СправочникСсылка.ВСД_ВидПродукции"));
		ПартииКСписанию.Колонки.Добавить("Партия",новый ОписаниеТипов("СправочникСсылка.ВСД_Партия"));
		ПартииКСписанию.Колонки.Добавить("Количество",новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
		ПартииКСписанию.Колонки.Добавить("Упаковки",новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
		ПартииКСписанию.Колонки.Добавить("ЕдиницаИзмерения",новый ОписаниеТипов("СправочникСсылка.ВСД_ЕдиницыИзмерения"));
		
		//ТЗВсегоСырье = Новый ("ТаблицаЗначений");
		//ТЗВсегоСырье.Колонки.Добавить("Продукция_Элемент",новый ОписаниеТипов("СправочникСсылка.ВСД_Продукция_Элемент"));
		//ТЗВсегоСырье.Колонки.Добавить("Количество",новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
		
		Для каждого СтрокаПродукции из тзНоменклатуры Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаПродукции.Номенклатура) Тогда 
				ВСД.СообщитьИнфо("Номенклатура не заполнена в строке"+СтрокаПродукции.НомерСтроки);
				Продолжить;
			КонецЕсли;			
			
			//1. Получаем список ВСД_Продукция_Элемент для Сырья Номенклатуры из Спецификации
			ТЗСырье = Новый("ТаблицаЗначений");
		    Запрос = Новый Запрос;
		    Запрос.Текст = "ВЫБРАТЬ
		                   |	СпецификацииНоменклатуры.Ссылка.Владелец КАК НоменклатураПродукция,
		                   |	СпецификацииНоменклатуры.Ссылка.Количество КАК КоличествоПродукции,
		                   |	СпецификацииНоменклатуры.Номенклатура КАК НоменклатураСырье,
		                   |	СпецификацииНоменклатуры.Количество КАК КоличествоСырья,
		                   |	ВСД_Соответсвия.ПродукцияЭлемент КАК Продукция_Элемент
		                   |ИЗ
		                   |	Справочник.СпецификацииНоменклатуры.ИсходныеКомплектующие КАК СпецификацииНоменклатуры
		                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
		                   |		ПО СпецификацииНоменклатуры.Номенклатура = ВСД_Соответсвия.Владелец
		                   |ГДЕ
		                   |	СпецификацииНоменклатуры.Ссылка.Владелец В ИЕРАРХИИ ( &ВыбНоменклатура) ";
			
		    Запрос.УстановитьПараметр("ВыбНоменклатура", СтрокаПродукции );
			тзСырье = Запрос.Выполнить().Выгрузить();
			
			//2. Формируем Актуальные партии для всего сырья = списка тзСырье
			тзАктуальныхПартий = ВСД.ПолучитьАктуальныеПартии( Параметры, тзСырье.ВыгрузитьКолонку("Продукция_Элемент"), Параметры["Отправитель_Площадка"], Параметры["Отправитель_ХозСубъект"]);
		
			тзСырье = ПолучитьСырьеИзСпецификацииНоменклатуры( СтрокаПродукции.Номенклатура, СтрокаПродукции.Количество );
			Если НЕ ЗначениеЗаполнено(тзСырье ) Тогда 
				Продолжить;
			КонецЕсли;
			
			тзЗаполнитьПартииСписанияПоТзПродукция( Параметры, тзСырье, тзСырье[0].Количество, тзАктуальныхПартий, ПартииКСписанию);
			
		КонецЦикла;
	Исключение
		ВСД.СообщитьИнфо("Ошибка "+ОписаниеОшибки());
		ПартииКСписанию = Новый ТаблицаЗначений;
	КонецПопытки;
	
	Возврат ПартииКСписанию;
КонецФункции

Функция ПолучитьНомерПартии( Знач ПараметрыОрганизации, СтрокаТчДок ) Экспорт
	// вызов переопределения
	ПереопределенныйМодуль = ВСД_Общий.ФункцияПереопределена("ПолучитьНомерПартии");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.ПолучитьНомерПартии( ПараметрыОрганизации, СтрокаТчДок );
	КонецЕсли;

	Попытка 
		//Возврат СтрокаТчДок.НомерПартии;
		Возврат Формат( ТекущаяДата(), "ДЛФ=Д");
	Исключение 
		Возврат "";
	Конецпопытки;
КонецФункции


#КонецОбласти
